app/controllers/doctors_controller.rb

SELECT * FROM `doctors` WHERE (`doctors`.`activation_code` = '34fe440d31af393331e8eaa3cee3fa992949d178') LIMIT 1
---
  def activate
    logout_keeping_session!
    doctor = Doctor.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?

SELECT * FROM `doctors` WHERE (`doctors`.`id` = 3)
---
    def find_doctor
      @doctor = Doctor.find(params[:id])