app/controllers/home_controller.rb

  def index
      @doctor = Doctor.find(params[:doctor_id])
      @doctor_list = []
      @doctor.quick_contacts.each{|qc| @doctor_list << Doctor.find(qc.contact_id) }
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1
SELECT * FROM `quick_contacts` WHERE (`quick_contacts`.doctor_id = 2)

  def compose_message
      flash[:notice] = ""
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1

  def send_message_from_quick_contact
    @doctor = current_doctor
    @send_doctor = Doctor.find(params[:id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1

 def create
   @doctor = current_doctor
   sms_status = ""
   flash[:notice]  = ""
   flash[:notice] += "Please enter the To address.\n" if params[:message].blank?
   flash[:notice] += "Please enter the Subject.\n" if params[:mail][:subject].empty?
   flash[:notice] += "Please enter the Message body.\n" if params[:mail][:body].empty?
   unless flash[:notice].empty?
      @subject = params[:mail][:subject]
      @body = params[:mail][:body]
      render :action => "compose_message"
   else
    rec_doctors = Doctor.find_all_by_email(params[:message][:to])
---
SELECT * FROM `mail` WHERE (message_id in (3) and doctor_id in (3)) LIMIT 1
SELECT * FROM `doctors` WHERE (`doctors`.`email` IN ('sangeetha@hibiscustech.com','sangeetha.ocean@gmail.com'))

  def inbox_messages
    if !current_doctor.mailbox[:inbox].mail.empty?
---
SELECT * FROM `mail` WHERE (`mail`.doctor_id = 3 AND (mail.mailbox = 'inbox' AND mail.trashed = 0)) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `mail` WHERE (((mail.doctor_id = 3) AND (mail.mailbox = 'inbox' AND mail.trashed = 0)) AND (mail.read = 0))

  def sent_messages
     if !current_doctor.mailbox[:sentbox].mail.empty?
---
SELECT * FROM `mail` WHERE (`mail`.doctor_id = 5 AND (mail.mailbox = 'sentbox' AND mail.trashed = 0)) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `mail` WHERE (((mail.doctor_id = 5) AND (mail.mailbox = 'inbox' AND mail.trashed = 0)) AND (mail.read = 0))

  def medical_staff_search
    result_ids = []

    case params[:search_type]
    when "A-F"
      result_ids = fetch_medical_search_results(params, ['A','B','C','D','E','F'])
    when "G-K"
      result_ids = fetch_medical_search_results(params, ['G','H','I','J','K'])
    when "L-P"
      result_ids = fetch_medical_search_results(params, ['L','M','N','O','P'])
    when "Q-U"
      result_ids = fetch_medical_search_results(params, ['Q','R','S','T','U'])
    when "V-Z"
      result_ids = fetch_medical_search_results(params, ['V','W','X','Y','Z'])
    when "medical_group"
      params[:medical_group_id] ||= 1  # first medical group in the drop down
      search_cond = ["medical_group_id = ?", params[:medical_group_id]]
      result_ids = DoctorMedicalGroup.find(:all, :conditions => search_cond, :select => "doctor_id").map(&:doctor_id)
      @medical_groups = MedicalGroup.find(:all)
    when "speciality"
      params[:speciality_id] ||= 2  # first specialty in the drop down - Allergy & Immunology
      search_cond = ["speciality_id = ?", params[:speciality_id]] unless params[:speciality_id].nil?
      result_ids = DoctorSpeciality.find(:all, :conditions => search_cond, :select => "doctor_id").map(&:doctor_id)
---
SELECT * FROM `medical_groups` WHERE (`medical_groups`.`id` = 1)
SELECT doctor_id FROM `doctor_medical_groups` WHERE (medical_group_id = 2)
SELECT doctor_id FROM `doctor_specialities` WHERE (speciality_id = 2)


      # remove the current doctor from the list
    result_ids.delete(current_doctor.id)
    @doctors = Doctor.find(:all, :conditions => ["id in (?)", result_ids])
---
SELECT id FROM `doctors` WHERE (name like 'A%' or name like 'B%' or name like 'C%' or name like 'D%' or name like 'E%' or name like 'F%')

  def add_to_quick_contact
    new_contact = Doctor.find(params[:id])
    unless current_doctor.quick_contacts.map(&:contact_id).include?(params[:id].to_i)
      contact = current_doctor.quick_contacts.build(:contact_id => params[:id])
      contact.save
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1
SELECT * FROM `quick_contacts` WHERE (`quick_contacts`.doctor_id = 1)
INSERT INTO `quick_contacts` (`doctor_id`, `created_at`, `updated_at`, `contact_id`) VALUES(1, '2012-06-05 12:25:16', '2012-06-05 12:25:16', 3)