app/controllers/messages_controller.rb

SELECT * FROM `mail` WHERE (`mail`.`encrypt_code` = '71fcee884d55e73257f13da5853c10ef51c635fa') LIMIT 1
---
     def secure_email
         @mail = Mail.find_by_encrypt_code(params[:encrypt_code]) unless params[:encrypt_code].blank?

SELECT * FROM `mail` WHERE (`mail`.`id` = 12)
SELECT * FROM `doctor_professional_profiles` WHERE (`doctor_professional_profiles`.doctor_id = 2) LIMIT 1
SELECT * FROM `doctors` INNER JOIN `messages_recipients` ON `doctors`.id = `messages_recipients`.recipient_id WHERE (`messages_recipients`.message_id = 5 )
---
     def check_pin_code
       @mail = Mail.find(params[:mail][:id])
       pin1 = params[:doctor_professional_profile][:pin1]
       pin2 = params[:doctor_professional_profile][:pin2]
       pin3 = params[:doctor_professional_profile][:pin3]
       pin4 = params[:doctor_professional_profile][:pin4]

       if pin1.empty? && pin2.empty? && pin3.empty? && pin4.empty?
          flash[:notice] = "Please enter Pin Code"
          render :action => :secure_email
       elsif pin1.empty? || pin2.empty? || pin3.empty? || pin4.empty?
          flash[:notice] = "Invalid Pin Code"
          render :action => :secure_email
       else
         doctor = Doctor.find(@mail.doctor_id)

SELECT * FROM `mail` WHERE (`mail`.`id` = 11)
SELECT * FROM `doctors` INNER JOIN `messages_recipients` ON `doctors`.id = `messages_recipients`.recipient_id WHERE (`messages_recipients`.message_id = 5 )
---
     def view_message
       @mail = Mail.find(params[:mail_id])
       doctor = Doctor.find(@mail.doctor_id)