app/controllers/mobile_controller.rb

SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)
---
  def fetch_radbox_messages
    get_doctor
    # hardcoding the recipient for demo purpose
    @doctor = Doctor.find(1)