app/controllers/profile_controller.rb

  def index
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 3) LIMIT 1

  def edit_basic_profile
    @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 6)

  def update_basic_profile
    @doctor = Doctor.find(params[:doctor_id])
    change_contact_email = false
    if @doctor.email != params[:doctor][:email] && @doctor.doctor_contact_info  && @doctor.doctor_contact_info.work_email == @doctor.email
      change_contact_email = true
    end
    if @doctor.update_attributes(params[:doctor])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 6)
UPDATE `doctor_contact_infos` SET `updated_at` = '2012-06-07 06:41:21', `work_email` = 'Sanjivini1@gmail.com' WHERE `id` = 5
UPDATE `doctors` SET `updated_at` = '2012-06-07 05:27:35', `email` = 'sanjivini1@gmail.com' WHERE `id` = 6

  def create_professional_profile
      @doctor = Doctor.find(params[:doctor_id])
      @doctor_specialities = @doctor.specialities
      @doctor_medical_groups = @doctor.medical_groups
      @doctor_hospitals = @doctor.hospitals
      @doctor_professional_profile = DoctorProfessionalProfile.new(params[:doctor_professional_profile])
      if @doctor_professional_profile.save
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 4) LIMIT 1
INSERT INTO `doctor_professional_profiles` (`medical_school`, `use_secure_pin`, `doctor_id`, `assistant_name`, `degree`, `sub_speciality`, `created_at`, `assistant_email`, `zip_code`, `graduation_year`, `updated_at`, `secure_pin`, `last_name`, `state`, `middle_name`, `office_address`, `web_url`, `first_name`) VALUES('', 1, 3, '', 'DMD', 'internal medicine - migraine', '2012-06-05 06:45:29', NULL, '76888', '', '2012-06-05 06:45:29', 9081, 'Rao', 'OH', '', 'Cleveland Clinic', '', 'Manasvi')

  def edit_professional_profile
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)

  def update_professional_profile
    @doctor = Doctor.find(params[:doctor_id])
    @doctor_professional_profile = @doctor.doctor_professional_profile
    if @doctor_professional_profile.update_attributes(params[:doctor_professional_profile])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)
UPDATE `doctor_professional_profiles` SET `use_secure_pin` = 0, `updated_at` = '2012-06-08 04:51:22' WHERE `id` = 1

  def new_speciality
    @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 5)

  def create_speciality
    @doctor = Doctor.find(params[:doctor_id])
    doctor_speciality = @doctor.speciality_ids
    if !doctor_speciality.include?(params[:speciality_id])
      @doctor_speciality = DoctorSpeciality.create(:doctor_id => @doctor.id, :speciality_id => params[:speciality_id], :priority => doctor_speciality.length.to_i+1)
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 5)
SELECT `specialities`.id FROM `specialities` INNER JOIN `doctor_specialities` ON `specialities`.id = `doctor_specialities`.speciality_id WHERE ((`doctor_specialities`.doctor_id = 5))
INSERT INTO `doctor_specialities` (`doctor_id`, `priority`, `created_at`, `updated_at`, `speciality_id`) VALUES(5, 1, '2012-06-05 06:54:22', '2012-06-05 06:54:22', 5)

  def delete_doctor_speciality
    @doctor = Doctor.find(params[:doctor_id])
    @doctor.doctor_specialities.find_by_speciality_id(params[:speciality_id]).delete
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)
DELETE FROM `doctor_specialities` WHERE (`id` IN (2))
SELECT * FROM `doctor_specialities` WHERE (`doctor_specialities`.`speciality_id` = '15') AND (`doctor_specialities`.doctor_id = 1) LIMIT 1

  def new_medical_group
    @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 5)

  def create_medical_group
    @doctor = Doctor.find(params[:doctor_id])
    doctor_medical = @doctor.medical_group_ids
    if !doctor_medical.include?(params[:medical_group][:id])
      @doctor_medical_group = DoctorMedicalGroup.create(:doctor_id => @doctor.id, :medical_group_id => params[:medical_group][:id], :priority => doctor_medical.length.to_i+1)
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 5)
SELECT `medical_groups`.id FROM `medical_groups` INNER JOIN `doctor_medical_groups` ON `medical_groups`.id = `doctor_medical_groups`.medical_group_id WHERE ((`doctor_medical_groups`.doctor_id = 5))
INSERT INTO `doctor_medical_groups` (`doctor_id`, `medical_group_id`, `priority`, `created_at`, `updated_at`) VALUES(5, 3, 1, '2012-06-05 06:55:10', '2012-06-05 06:55:10')

  def contact_info
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1

  def create_contact_info_profile
      @doctor = Doctor.find(params[:doctor_id])
      @doctor_contact_info = DoctorContactInfo.new(params[:doctor_contact_info])
      @doctor_contact_share = DoctorContactShare.new(params[:doctor_contact_share])
      @hospital_contact_share = HospitalContactShare.new(params[:hospital_contact_share])
      @public_contact_share = PublicContactShare.new(params[:public_contact_share])
      if @doctor_contact_info.save
          @doctor_contact_share.save
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 2)
INSERT INTO `doctor_contact_infos` (`personal_email`, `mobile_number`, `pager`, `assistant_number`, `work_email`, `office_number`, `back_line_number`, `office_email`, `updated_at`, `assistant_name`, `created_at`, `doctor_id`) VALUES('', '677-890-7890', '', '', 'santhosh.hrishi79in@gmail.com', '', '', '', '2012-06-07 06:12:57', NULL, '2012-06-07 06:12:57', 6)
INSERT INTO `hospital_contact_shares` (`personal_email`, `pager`, `assistant_number`, `work_email`, `office_number`, `back_line_number`, `office_email`, `updated_at`, `assistant_name`, `created_at`, `doctor_id`, `mobile`) VALUES(0, 1, 1, 1, 1, 0, 1, '2012-06-07 06:12:57', 0, '2012-06-07 06:12:57', 6, 0)

  def edit_contact_info_profile
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)

  def update_contact_info_profile
      @doctor = Doctor.find(params[:doctor_id])
      @doctor_contact_info = @doctor.doctor_contact_info
       doctor_share = DoctorContactShare.set_default_values(@doctor.doctor_contact_share)
       doctor_contact_share =  @doctor.doctor_contact_share.update_attributes(params[:doctor_contact_share])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)
UPDATE `doctor_contact_infos` SET `mobile_number` = '415-519-5475', `updated_at` = '2012-06-07 04:39:37' WHERE `id` = 2
UPDATE `doctor_contact_shares` SET `work_email` = 0, `office_email` = 0, `mobile` = 0, `back_line_number` = 0, `personal_email` = 0, `updated_at` = '2012-06-07 04:39:37', `office_number` = 0, `pager` = 0, `assistant_number` = 0 WHERE `id` = 2

  def personal_profile
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1) LIMIT 1

  def create_personal_profile
      @doctor = Doctor.find(params[:doctor_id])
      @doctor_personal_profile = DoctorPersonalProfile.new(params[:doctor_personal_profile])
      if @doctor_personal_profile.save
---
SELECT * FROM `doctors` WHERE (`doctors`.`id` = 1)
INSERT INTO `doctor_personal_profiles` (`avatar_content_type`, `languages`, `avatar_file_size`, `interests`, `avatar_updated_at`, `doctor_id`, `created_at`, `updated_at`, `avatar_file_name`) VALUES('image/jpeg', 'english,kannada', 3133, 'reading books', '2012-06-06 04:33:38', 1, '2012-06-06 04:33:38', '2012-06-06 04:33:38', 'doc4.jpg')